АвтосервисАвтомагазин/src/Catalogs/АС2_Ресурсы/АС2_Ресурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АС2_Ресурсы</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

АвтосервисАвтомагазин/src/InformationRegisters/КалендарныеГрафики/КалендарныеГрафики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17aadd5f-cda2-4785-a07f-3ab4b04434a6">
  <name>КалендарныеГрафики</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="71bc35e6-0fec-4e54-af2d-23d1357d1c3b">
    <name>ДеньВключенВГрафик</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ff9f7b5c-70f4-4eed-8216-64448e7da76f">
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d5df31c3-89f9-469c-80a9-fb4706d30bc4">
    <name>ДатаГрафика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

АвтосервисАвтомагазин/src/Catalogs/АС2_Ресурсы/ManagerModule.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает доступные на дату ресурсы
// 
// Параметры:
//  Дата - Дата - Дата
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Доступные ресурсы на дату
Функция ДоступныеРесурсыНаДату(Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаГрафика", Дата);

	Запрос.Текст = "ВЫБРАТЬ
				   |	АС2_Ресурсы.Ссылка КАК Ссылка,
				   |	АС2_Ресурсы.Наименование КАК Наименование,
				   |	АС2_Ресурсы.Описание КАК Описание,
				   |	АС2_Ресурсы.Календарь КАК Календарь,
				   |	АС2_Ресурсы.Пользователь.Представление КАК Сотрудник,
				   |	""                              "" КАК РабочаяОбласть
				   |ИЗ
				   |	Справочник.АС2_Ресурсы КАК АС2_Ресурсы
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
				   |		ПО АС2_Ресурсы.Календарь = КалендарныеГрафики.Календарь
				   |ГДЕ
				   |	КалендарныеГрафики.ДатаГрафика = &ДатаГрафика
				   |	И КалендарныеГрафики.ДеньВключенВГрафик";

	НаборРесурсов = Запрос.Выполнить().Выгрузить();

	Возврат НаборРесурсов;

КонецФункции

#КонецОбласти

#КонецЕсли
